# Consumer Sales Case Study

## Data Background

* This is a global food distribution company (canned goods, produce, meats, etc.)
* The dataset covers about 2 years of sales and inventory data
* It is distributed across multiple tables, and even in different languages!
* This is an exercise very similar to what you'd be doing with relational databases with a larger enterprise company
  * It is not too big, not too small
* The dataset was originally used for [qlik](https://sense-demo.qlik.com/sense/app/372cbc85-f7fb-4db6-a620-9a5367845dce)
* If you want, try clicking (pun intended) around in their web-based solution to familiarize yourself with the data

## What Are We Looking For?

Your boss, Joanna, has requested the following reports:

  1. Top 10 Product Type by Gross Sales
  1. Average Margin (%) by Product Group

  1. Top 10 Sales Reps and their Total Sales and Sales Quantity
  1. Average Margin vs Gross Sales
  1. Total Sales by Month
  1. Total Sales by Month, Year over Year

## Data Dictionary

A data dictionary has been provided for you below:

<details id='dictionary'>
    <summary>Data Dictionary</summary>
    <br>
    <!-- table created with https://www.tablesgenerator.com/html_tables please see ../assets/dictionary.tgn file -->
    <table>
  <tr>
    <th>Table</th>
    <th>Field</th>
    <th>Description</th>
    <th>PK</th>
    <th>FK</th>
  </tr>
  <tr>
    <td>Item master.xls</td>
    <td>Item Number</td>
    <td>Foreign key to Sales.Item Number field. Unique identifier for item</td>
    <td>Y</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Item master.xls</td>
    <td>Product Group</td>
    <td>Group for the product, i.e. Frozen Foods, Deli, etc</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Item master.xls</td>
    <td>Product Line</td>
    <td>Product line, i.e. Food, Drink, etc</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Item master.xls</td>
    <td>Product Sub Group</td>
    <td>Detail field for the Product Group field, i.e. Produce -&gt; Fresh Vegetables</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Item master.xls</td>
    <td>Product Type</td>
    <td>Type of product and additional detail at the sub group level, i.e. 'Breakfast Foods'</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Manager</td>
    <td>Name of manager</td>
    <td>N</td>
    <td>N</td>
  </tr>  
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Manager Number</td>
    <td>ID of manager</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Path</td>
    <td>Order through which sales passes through reps, separated by hyphens. Correlates with Sales Rep ID key.</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Sales Rep Name</td>
    <td>Primary sales rep name</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Sales Rep Name 1</td>
    <td>Secondary sales rep name (nullable)</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Sales Rep Name 2</td>
    <td>Tertiary sales rep name (nullable)</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Sales Rep Name 3</td>
    <td>Quaterinary sales rep name (nullable)</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales&nbsp;&nbsp;rep.csv</td>
    <td>Sales Rep ID</td>
    <td>Foreign key to Sales. UID for path.</td>
    <td>N</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Customers.xlsx</td>
    <td>Customer</td>
    <td>Name of customer</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Customers.xlsx</td>
    <td>Customer Number</td>
    <td>Unique identifier for customer name, keys to Sales.Customer Number</td>
    <td>Y</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Customers.xlsx</td>
    <td>City Code</td>
    <td>City ID, foreign key for City.City Code</td>
    <td>N</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Cities.xlsx</td>
    <td>City</td>
    <td>Name of city</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Cities.xlsx</td>
    <td>City Code</td>
    <td>ID of city name</td>
    <td>Y</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Cities.xlsx</td>
    <td>Region</td>
    <td>Sales region (i.e. USA, Nordic, etc)</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Cities.xlsx</td>
    <td>Latitude</td>
    <td>Latitude of city</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
      <td>Cities.xlsx</td>
    <td>Longitude</td>
    <td>Longitude of city</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Cities.xlsx</td>
    <td>Desc</td>
    <td>String description of city, including city, state (if applicable), and country</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>%KEY</td>
    <td>Primary key of table</td>
    <td>Y</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Cost</td>
    <td>Total cost of sale for transaction [USD]</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Customer Number</td>
    <td>Customer number, keys to Customer.Customer Number</td>
    <td>N</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Date</td>
    <td>Date of sale</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>GrossSales</td>
    <td>Gross sale for invoice [USD]</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Invoice Date</td>
    <td>Date of invoice</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Item Desc</td>
    <td>Description of invoiced item</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Item Number</td>
    <td>ID of invoiced item (product) - not a primary key. Keys to Item.Item Number</td>
    <td>N</td>
    <td>Y</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Margin</td>
    <td>Percent gross margin of line item sale</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Order Number</td>
    <td>ID of the order placed</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Promised Delivery Date</td>
    <td>Agreed date of delivery</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Sales</td>
    <td>Gross sale for invoice [USD], less cost of sale</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Sales Qty</td>
    <td>Qty of invoiced item sold (see Item Number, Item Desc)</td>
    <td>N</td>
    <td>N</td>
  </tr>
  <tr>
    <td>Sales.xlsx</td>
    <td>Sales Rep Number</td>
    <td>Sales rep ID credited with sale</td>
    <td>N</td>
    <td>Y</td>
  </tr>
</table>
</details>

# EDA

Before we create our charts/reports for Joanna, we'll need to sanity check our input data. We'll get to the analysis  and visualization and reporting later.

## Import Libraries

Import any libraries you need here.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

## Import Data

Read in the data in the `data` directory.

Check the raw files to make sure you understand quote characters, delimiters, and encoding. You will need to use the `encoding` kwarg here since we are dealing with international character sets ([docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)).

A handy command (on Mac/Linux) is `file`, which tries to guess the encoding of a file. (On Windows, you might need a tool like [EncodingChecker](https://archive.codeplex.com/?p=encodingchecker).)

`!` is used to run a *shell command*.

In [3]:
!ls data

cities.csv      customers.csv   item_master.csv sales.csv       sales_rep.csv

In [6]:
!file data/*.csv

data/cities.csv:      UTF-8 Unicode text
data/customers.csv:   UTF-8 Unicode text
data/item_master.csv: ASCII text
data/sales.csv:       ASCII text
data/sales_rep.csv:   ASCII text

Files that are encoded as `ASCII text` contains just plain English characters, so nothing is needed other than a plain `read_csv`. Let's read those in first.

In [7]:
sales       = pd.read_csv('data/sales.csv')
item_master = pd.read_csv('data/item_master.csv')
sales_rep   = pd.read_csv('data/sales_rep.csv')

`UTF-8 Unicode text` means there could possibly be some non-English characters there. 

[Encodings are tricky](https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/) and out of the scope of this course, but here are the list of [Python Standard Encodings](https://docs.python.org/3/library/codecs.html#standard-encodings). 

It turns out that UTF-8 is a fairly modern standard and Python is able to read `utf-8` with the `encoding='utf-8'` kwarg.

Depending on how the file was exported and if it was with an order type of encoding you could have more trouble than this!

In [8]:
cities = pd.read_csv('data/cities.csv', encoding='utf-8')
customers = pd.read_csv('data/customers.csv', encoding='utf-8')

And just to make sure it imported properly, let's see if a certain Swedish city of [Malmö](https://en.wikipedia.org/wiki/Malmö) prints correctly:

In [12]:
print(cities.iloc[63]['Desc'])

"Malmö, Malmö, Skåne län, SE"

Awesome.

Now let's take a quick look at the data inside each of these dataframes:

In [14]:
print(sales.shape,
      item_master.shape,
      sales_rep.shape,
      cities.shape,
      customers.shape,
      sep='\n')

(96466, 15)
(827, 5)
(64, 8)
(100, 6)
(684, 3)

In [15]:
sales.head(5)

,%KEY,Cost,Customer Number,Date,GrossSales,Invoice Date,Invoice Number,Item Desc,Item Number,Margin,Order Number,Promised Delivery Date,Sales,Sales Qty,Sales Rep Number
0,3428,-513.15,10012226,1/12/2012,-573.3835,1/12/2012,318960,Cutting Edge Sliced Ham,10696,-37.29,115785,1/12/2012,-550.44,-1.0,180
1,3429,-105.93,10012226,1/12/2012,-204.6638,1/12/2012,318960,Washington Cranberry Juice,10009,-90.54,115785,1/12/2012,-196.47,-2.0,180
2,3430,-88.07,10012226,1/12/2012,-165.8016,1/12/2012,318960,Moms Sliced Ham,10385,-71.10,115785,1/12/2012,-159.17,-3.0,180
3,3431,-43.12,10012226,1/12/2012,-118.3703,1/12/2012,318960,Tip Top Lox,10215,-70.52,115785,1/12/2012,-113.64,-1.0,180
4,3432,-37.98,10012226,1/12/2012,-102.3319,1/12/2012,318960,Just Right Beef Soup,10965,-60.26,115785,1/12/2012,-98.24,-1.0,180

In [16]:
item_master.head(5)

,Item Number,Product Group,Product Line,Product Sub Group,Product Type
0,10001,Beverages,Drink,Juice,Pure Juice Beverages
1,10002,Beverages,Drink,Flavored Drinks,Drinks
2,10003,Beverages,Drink,Flavored Drinks,Drinks
3,10004,Beverages,Drink,Soda,Carbonated Beverages
4,10005,Beverages,Drink,Soda,Carbonated Beverages

In [21]:
sales_rep.head(5)

,Manager,Manager Number,Path,Sales Rep Name,Sales Rep Name1,Sales Rep Name2,Sales Rep Name3,Sales Rep ID
0,Amanda Honda,104,Amanda Honda-Amalia Craig,Amalia Craig,Amanda Honda,Amalia Craig,NaN,103
1,Amanda Honda,104,Amanda Honda-Cart Lynch,Cart Lynch,Amanda Honda,Cart Lynch,NaN,112
2,Amanda Honda,104,Amanda Honda-Molly McKenzie,Molly McKenzie,Amanda Honda,Molly McKenzie,NaN,159
3,Amanda Honda,104,Amanda Honda-Sheila Hein,Sheila Hein,Amanda Honda,Sheila Hein,NaN,176
4,Brenda Gibson,109,Brenda Gibson-Dennis Johnson,Dennis Johnson,Brenda Gibson,Dennis Johnson,NaN,121

In [22]:
cities.head(5)

,City,City Code,Region,Latitude,Longitude,Desc
0,New York,1,USA,40.730599,-73.986581,"""New York City, NY, US"""
1,Los Angeles,2,USA,34.053678,-118.242702,"""Los Angeles, Los Angeles County, CA, US"""
2,Chicago,3,USA,41.875555,-87.624421,"""Chicago, Cook County, IL, US"""
3,Houston,4,USA,29.981501,-95.538360,"""Houston, Harris County, TX, US"""
4,Philadelphia,5,USA,39.952335,-75.163789,"""Philadelphia, Philadelphia County, PA, US"""

In [23]:
customers.head(5)

            Customer  Customer Number  City Code
0  A Superior System         10000453          1
1                A&B         10000456         76
2                A&G         10000457          2
3       A&R Partners         10000458         43
4  A1 Datacom Supply         10000461         77

## Duplicated Primary Keys

Each table should have a unique **Primary Key**. Let's do a sanity check to make sure they are indeed unique.

In [32]:
print(sales['%KEY'].value_counts(dropna=False).head(3),
      item_master['Item Number'].value_counts(dropna=False).head(3),
      sales_rep['Sales Rep ID'].value_counts(dropna=False).head(3),
      cities['City Code'].value_counts(dropna=False).head(3),
      customers['Customer Number'].value_counts(dropna=False).head(3),
      sep = '\n\n')

2047     1
47874    1
90873    1
Name: %KEY, dtype: int64

10239    1
10571    1
10581    1
Name: Item Number, dtype: int64

127    1
125    1
168    1
Name: Sales Rep ID, dtype: int64

100    1
37     1
27     1
Name: City Code, dtype: int64

10021911    2
10024034    1
10006846    1
Name: Customer Number, dtype: int64

Oops! It turns out that customer number `10021911` is actually duplicated in the `customers` source data table. This could be due to a misconfigured database that allowed a duplicate primary key to sneak into the database... it happens!

In [33]:
customers[ customers['Customer Number'] == 10021911 ]

    Customer  Customer Number  City Code
467     PING         10021911         64
468     Ping         10021911         65

The difference appears to be in the customer's name being capitalized or not, and a different city code. Unfortunately in the absence of further information it is difficult here to determine why the duplicate Customer Number has happened. 

A duplicate Customer Number will throw a wrench in our joins later when we stitch tables up. So, the easiest thing to do here is to note the discrepancy, and delete the extra customer, or assign its customer number to a value that doesn't exist.

In this case, the next customer number in the sequence, `10021912`, doesn't exist. So we'll set `Ping` to that number.

In [34]:
customers[ customers['Customer Number'] == 10021912 ]

Empty DataFrame
Columns: [Customer, Customer Number, City Code]
Index: []

How do you set the value of a single data cell? You may recall that you can *read* the value of a data cell with `loc` or `iloc`:

In [35]:
customers.iloc[468]['Customer Number']

10021911

But if you try to set the value of that cell, Pandas will give you an error. See the [docs](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#why-does-assignment-fail-when-using-chained-indexing) for more details.

In [36]:
customers.iloc[468]['Customer Number'] = 10021912

/Users/fred/.pyenv/versions/anaconda3-2020.02/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [39]:
customers.at[468, 'Customer Number'] = 10021912

The way to set a particular value is to use the `at` syntax. There are other ways as well, but for simplicity it is recommended to use `at` for setting a single value. ([docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html))

In [41]:
customers[ (customers['Customer Number'] == 10021911) | (customers['Customer Number'] == 10021912) ]

    Customer  Customer Number  City Code
467     PING         10021911         64
468     Ping         10021912         65

In [42]:
customers['Customer Number'].value_counts(dropna=False).head(3)

10024034    1
10006846    1
10025287    1
Name: Customer Number, dtype: int64

## Nulls

Check for nulls and missing values in all the dataframes. If you are filling missing values, state your reasoning for dropping and/or imputing data.

For the `cities` dataframe, it's just a Description that is null, so we'll leave it alone as it's not likely we'll need that piece of data.

As for Sales Reps, it looks like we don't have a 2nd or 3rd sales rep in certain territories, so that's fine.

## Data Types

Review all the dataframes and convert the data types if necessary, according to the rules in the following table:

| Kind of Data | Data Type |
| :--- | :--- |
| Primary Key or Foreign Key | `int64` |
| Currency | `float64` |
| Text | `object` (string) |
| Discrete values | `int64` |
| Dates | `datetime64[ns]` (Timestamp object) |

In general the data types look good as-is with the exception of:

1. The datetime fields in the `sales` dataframe

2. The `Sales Qty` field in `sales` should be an `int` as we can't have fractional quantities. We can use the [`astype` method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html) to do this:

Let's do a final check on the `sales` dataframe:

## Join

Join all your tables together and store the joined result into a dataframe named `cs`. You'll need this for the Reporting and Visualization section below. 

Use the data dictionary for guidance.

Make sure the shape of the joined table makes sense!

It turns out we don't need a bunch of columns, so let's drop 'em so things run faster. In real life you'd only know this after a few iterations, and it would have made things faster to drop them before the join.

# Analysis

* Create a new column, `MarginPct`, which is the `Margin` (`Sales` minus `Cost`), divided by `Sales`. Store this value as a float (percentage).

# Reporting and Visualization

Create charts or reports according to Joanna's expectations.

Use your best judgement to create visualizations or reports to best answer the questions. Ask yourself questions such as:

* Is the data I'm using categorical or continuous?
* Am I looking at timeseries data?
* Am I representing a part-of-a-whole relationship?
* Do I have many data points? If so, could I report or chart a subset of that data?

<!--
There's no right or wrong answer to these questions. As you solve them, focus on this progression:

* First, create a pandas report with a dataframe or list of values that attempts to answer Joanna's questions
* If you get that done, try charting it using a pandas charting method, like `.plot()`
* If you get that done, look at how you might make your chart *more information dense*
  * Increase chart ink area
  * Reduce visual clutter
  * Use color to convey meaning
  * Increase information density with shape, size, color
  * Use callouts to highlight anomalies in your data or points of interest
* If you get that done, look at graduating from the [pandas plotting methods](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) to [matplotlib](https://matplotlib.org/), which is the backend for pandas plotting. This will allow you more control over your plots but the learning curve is fairly steep. Hang in there!
-->

## 1. Gross Sales by Product Type (Top 10)

## 2. Average Margin (%) by Product Group

## 3. Top 10 Sales Reps and their Total Sales and Sales Quantity

(Formatted as a table)

## 4. Scatter Plot of Average Margin [%] vs Average Gross Sales

## 5. Total Sales by Month

## 6. Total Sales by Month, Year over Year